/*
 * Copyright 2019 All rights reserved.
 */

package cn.muses.utils.area;

import java.io.Serializable;
import java.util.List;
import java.util.concurrent.atomic.AtomicLong;

import org.apache.commons.collections4.CollectionUtils;

import com.fasterxml.jackson.databind.ObjectMapper;

import cn.muses.utils.json.JsonMapper;

/**
 * @author jervis
 * @date 2021/9/7.
 */
public class AreaParse {
    private static AtomicLong atomicLong = new AtomicLong(0);

    public static void main(String[] args) {
        String str = "[\n" +
            "  {\n" +
            "    \"children\": [],\n" +
            "    \"label\": \"北京市\",\n" +
            "    \"value\": \"110000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [],\n" +
            "    \"label\": \"天津市\",\n" +
            "    \"value\": \"120000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"石家庄\",\n" +
            "        \"value\": \"130100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"唐山\",\n" +
            "        \"value\": \"130200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"秦皇岛\",\n" +
            "        \"value\": \"130300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"邯郸\",\n" +
            "        \"value\": \"130400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"邢台\",\n" +
            "        \"value\": \"130500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"保定\",\n" +
            "        \"value\": \"130600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"张家口\",\n" +
            "        \"value\": \"130700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"承德\",\n" +
            "        \"value\": \"130800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"沧州\",\n" +
            "        \"value\": \"130900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"廊坊\",\n" +
            "        \"value\": \"131000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"衡水\",\n" +
            "        \"value\": \"131100\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"河北省\",\n" +
            "    \"value\": \"130000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"太原\",\n" +
            "        \"value\": \"140100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"大同\",\n" +
            "        \"value\": \"140200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阳泉\",\n" +
            "        \"value\": \"140300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"长治\",\n" +
            "        \"value\": \"140400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"晋城\",\n" +
            "        \"value\": \"140500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"朔州\",\n" +
            "        \"value\": \"140600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"晋中\",\n" +
            "        \"value\": \"140700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"运城\",\n" +
            "        \"value\": \"140800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"忻州\",\n" +
            "        \"value\": \"140900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"临汾\",\n" +
            "        \"value\": \"141000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"吕梁\",\n" +
            "        \"value\": \"141100\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"山西省\",\n" +
            "    \"value\": \"140000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"呼和浩特\",\n" +
            "        \"value\": \"150100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"包头\",\n" +
            "        \"value\": \"150200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"乌海\",\n" +
            "        \"value\": \"150300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"赤峰\",\n" +
            "        \"value\": \"150400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"通辽\",\n" +
            "        \"value\": \"150500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鄂尔多斯\",\n" +
            "        \"value\": \"150600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"呼伦贝尔\",\n" +
            "        \"value\": \"150700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"巴彦淖尔\",\n" +
            "        \"value\": \"150800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"乌兰察布\",\n" +
            "        \"value\": \"150900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"兴安盟\",\n" +
            "        \"value\": \"152200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"锡林郭勒盟\",\n" +
            "        \"value\": \"152500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阿拉善盟\",\n" +
            "        \"value\": \"152900\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"内蒙古自治区\",\n" +
            "    \"value\": \"150000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"沈阳\",\n" +
            "        \"value\": \"210100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"大连\",\n" +
            "        \"value\": \"210200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鞍山\",\n" +
            "        \"value\": \"210300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"抚顺\",\n" +
            "        \"value\": \"210400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"本溪\",\n" +
            "        \"value\": \"210500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"丹东\",\n" +
            "        \"value\": \"210600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"锦州\",\n" +
            "        \"value\": \"210700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"营口\",\n" +
            "        \"value\": \"210800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阜新\",\n" +
            "        \"value\": \"210900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"辽阳\",\n" +
            "        \"value\": \"211000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"盘锦\",\n" +
            "        \"value\": \"211100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"铁岭\",\n" +
            "        \"value\": \"211200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"朝阳\",\n" +
            "        \"value\": \"211300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"葫芦岛\",\n" +
            "        \"value\": \"211400\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"辽宁省\",\n" +
            "    \"value\": \"210000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"长春\",\n" +
            "        \"value\": \"220100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"吉林\",\n" +
            "        \"value\": \"220200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"四平\",\n" +
            "        \"value\": \"220300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"辽源\",\n" +
            "        \"value\": \"220400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"通化\",\n" +
            "        \"value\": \"220500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"白山\",\n" +
            "        \"value\": \"220600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"松原\",\n" +
            "        \"value\": \"220700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"白城\",\n" +
            "        \"value\": \"220800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"延边\",\n" +
            "        \"value\": \"222400\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"吉林省\",\n" +
            "    \"value\": \"220000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"哈尔滨\",\n" +
            "        \"value\": \"230100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"齐齐哈尔\",\n" +
            "        \"value\": \"230200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鸡西\",\n" +
            "        \"value\": \"230300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鹤岗\",\n" +
            "        \"value\": \"230400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"双鸭山\",\n" +
            "        \"value\": \"230500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"大庆\",\n" +
            "        \"value\": \"230600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"伊春\",\n" +
            "        \"value\": \"230700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"佳木斯\",\n" +
            "        \"value\": \"230800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"七台河\",\n" +
            "        \"value\": \"230900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"牡丹江\",\n" +
            "        \"value\": \"231000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黑河\",\n" +
            "        \"value\": \"231100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"绥化\",\n" +
            "        \"value\": \"231200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"大兴安岭\",\n" +
            "        \"value\": \"232700\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"黑龙江省\",\n" +
            "    \"value\": \"230000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [],\n" +
            "    \"label\": \"上海市\",\n" +
            "    \"value\": \"310000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南京\",\n" +
            "        \"value\": \"320100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"无锡\",\n" +
            "        \"value\": \"320200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"徐州\",\n" +
            "        \"value\": \"320300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"常州\",\n" +
            "        \"value\": \"320400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"苏州\",\n" +
            "        \"value\": \"320500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南通\",\n" +
            "        \"value\": \"320600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"连云港\",\n" +
            "        \"value\": \"320700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"淮安\",\n" +
            "        \"value\": \"320800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"盐城\",\n" +
            "        \"value\": \"320900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"扬州\",\n" +
            "        \"value\": \"321000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"镇江\",\n" +
            "        \"value\": \"321100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"泰州\",\n" +
            "        \"value\": \"321200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宿迁\",\n" +
            "        \"value\": \"321300\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"江苏省\",\n" +
            "    \"value\": \"320000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"杭州\",\n" +
            "        \"value\": \"330100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宁波\",\n" +
            "        \"value\": \"330200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"温州\",\n" +
            "        \"value\": \"330300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"嘉兴\",\n" +
            "        \"value\": \"330400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"湖州\",\n" +
            "        \"value\": \"330500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"绍兴\",\n" +
            "        \"value\": \"330600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"金华\",\n" +
            "        \"value\": \"330700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"衢州\",\n" +
            "        \"value\": \"330800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"舟山\",\n" +
            "        \"value\": \"330900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"台州\",\n" +
            "        \"value\": \"331000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"丽水\",\n" +
            "        \"value\": \"331100\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"浙江省\",\n" +
            "    \"value\": \"330000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"合肥\",\n" +
            "        \"value\": \"340100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"芜湖\",\n" +
            "        \"value\": \"340200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"蚌埠\",\n" +
            "        \"value\": \"340300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"淮南\",\n" +
            "        \"value\": \"340400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"马鞍山\",\n" +
            "        \"value\": \"340500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"淮北\",\n" +
            "        \"value\": \"340600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"铜陵\",\n" +
            "        \"value\": \"340700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"安庆\",\n" +
            "        \"value\": \"340800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黄山\",\n" +
            "        \"value\": \"341000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"滁州\",\n" +
            "        \"value\": \"341100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阜阳\",\n" +
            "        \"value\": \"341200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宿州\",\n" +
            "        \"value\": \"341300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"巢湖\",\n" +
            "        \"value\": \"341400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"六安\",\n" +
            "        \"value\": \"341500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"亳州\",\n" +
            "        \"value\": \"341600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"池州\",\n" +
            "        \"value\": \"341700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宣城\",\n" +
            "        \"value\": \"341800\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"安徽省\",\n" +
            "    \"value\": \"340000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"福州\",\n" +
            "        \"value\": \"350100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"厦门\",\n" +
            "        \"value\": \"350200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"莆田\",\n" +
            "        \"value\": \"350300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"三明\",\n" +
            "        \"value\": \"350400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"泉州\",\n" +
            "        \"value\": \"350500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"漳州\",\n" +
            "        \"value\": \"350600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南平\",\n" +
            "        \"value\": \"350700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"龙岩\",\n" +
            "        \"value\": \"350800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宁德\",\n" +
            "        \"value\": \"350900\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"福建省\",\n" +
            "    \"value\": \"350000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南昌\",\n" +
            "        \"value\": \"360100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"景德镇\",\n" +
            "        \"value\": \"360200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"萍乡\",\n" +
            "        \"value\": \"360300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"九江\",\n" +
            "        \"value\": \"360400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"新余\",\n" +
            "        \"value\": \"360500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鹰潭\",\n" +
            "        \"value\": \"360600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"赣州\",\n" +
            "        \"value\": \"360700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"吉安\",\n" +
            "        \"value\": \"360800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宜春\",\n" +
            "        \"value\": \"360900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"抚州\",\n" +
            "        \"value\": \"361000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"上饶\",\n" +
            "        \"value\": \"361100\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"江西省\",\n" +
            "    \"value\": \"360000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"济南\",\n" +
            "        \"value\": \"370100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"青岛\",\n" +
            "        \"value\": \"370200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"淄博\",\n" +
            "        \"value\": \"370300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"枣庄\",\n" +
            "        \"value\": \"370400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"东营\",\n" +
            "        \"value\": \"370500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"烟台\",\n" +
            "        \"value\": \"370600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"潍坊\",\n" +
            "        \"value\": \"370700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"济宁\",\n" +
            "        \"value\": \"370800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"泰安\",\n" +
            "        \"value\": \"370900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"威海\",\n" +
            "        \"value\": \"371000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"日照\",\n" +
            "        \"value\": \"371100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"莱芜\",\n" +
            "        \"value\": \"371200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"临沂\",\n" +
            "        \"value\": \"371300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"德州\",\n" +
            "        \"value\": \"371400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"聊城\",\n" +
            "        \"value\": \"371500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"滨州\",\n" +
            "        \"value\": \"371600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"菏泽\",\n" +
            "        \"value\": \"371700\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"山东省\",\n" +
            "    \"value\": \"370000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"郑州\",\n" +
            "        \"value\": \"410100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"开封\",\n" +
            "        \"value\": \"410200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"洛阳\",\n" +
            "        \"value\": \"410300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"平顶山\",\n" +
            "        \"value\": \"410400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"安阳\",\n" +
            "        \"value\": \"410500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鹤壁\",\n" +
            "        \"value\": \"410600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"新乡\",\n" +
            "        \"value\": \"410700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"焦作\",\n" +
            "        \"value\": \"410800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"济源\",\n" +
            "        \"value\": \"410881\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"濮阳\",\n" +
            "        \"value\": \"410900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"许昌\",\n" +
            "        \"value\": \"411000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"漯河\",\n" +
            "        \"value\": \"411100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"三门峡\",\n" +
            "        \"value\": \"411200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南阳\",\n" +
            "        \"value\": \"411300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"商丘\",\n" +
            "        \"value\": \"411400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"信阳\",\n" +
            "        \"value\": \"411500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"周口\",\n" +
            "        \"value\": \"411600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"驻马店\",\n" +
            "        \"value\": \"411700\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"河南省\",\n" +
            "    \"value\": \"410000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"武汉\",\n" +
            "        \"value\": \"420100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黄石\",\n" +
            "        \"value\": \"420200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"十堰\",\n" +
            "        \"value\": \"420300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宜昌\",\n" +
            "        \"value\": \"420500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"襄樊\",\n" +
            "        \"value\": \"420600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"鄂州\",\n" +
            "        \"value\": \"420700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"荆门\",\n" +
            "        \"value\": \"420800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"孝感\",\n" +
            "        \"value\": \"420900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"荆州\",\n" +
            "        \"value\": \"421000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黄冈\",\n" +
            "        \"value\": \"421100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"咸宁\",\n" +
            "        \"value\": \"421200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"随州\",\n" +
            "        \"value\": \"421300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"恩施\",\n" +
            "        \"value\": \"422800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"仙桃\",\n" +
            "        \"value\": \"429004\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"潜江\",\n" +
            "        \"value\": \"429005\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"天门\",\n" +
            "        \"value\": \"429006\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"神农架\",\n" +
            "        \"value\": \"429021\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"湖北省\",\n" +
            "    \"value\": \"420000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"长沙\",\n" +
            "        \"value\": \"430100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"株洲\",\n" +
            "        \"value\": \"430200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"湘潭\",\n" +
            "        \"value\": \"430300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"衡阳\",\n" +
            "        \"value\": \"430400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"邵阳\",\n" +
            "        \"value\": \"430500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"岳阳\",\n" +
            "        \"value\": \"430600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"常德\",\n" +
            "        \"value\": \"430700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"张家界\",\n" +
            "        \"value\": \"430800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"益阳\",\n" +
            "        \"value\": \"430900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"郴州\",\n" +
            "        \"value\": \"431000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"永州\",\n" +
            "        \"value\": \"431100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"怀化\",\n" +
            "        \"value\": \"431200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"娄底\",\n" +
            "        \"value\": \"431300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"湘西\",\n" +
            "        \"value\": \"433100\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"湖南省\",\n" +
            "    \"value\": \"430000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"广州\",\n" +
            "        \"value\": \"440100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"韶关\",\n" +
            "        \"value\": \"440200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"深圳\",\n" +
            "        \"value\": \"440300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"珠海\",\n" +
            "        \"value\": \"440400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"汕头\",\n" +
            "        \"value\": \"440500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"佛山\",\n" +
            "        \"value\": \"440600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"江门\",\n" +
            "        \"value\": \"440700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"开平\",\n" +
            "        \"value\": \"440783\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"湛江\",\n" +
            "        \"value\": \"440800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"茂名\",\n" +
            "        \"value\": \"440900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"肇庆\",\n" +
            "        \"value\": \"441200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"惠州\",\n" +
            "        \"value\": \"441300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"梅州\",\n" +
            "        \"value\": \"441400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"汕尾\",\n" +
            "        \"value\": \"441500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"河源\",\n" +
            "        \"value\": \"441600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阳江\",\n" +
            "        \"value\": \"441700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"清远\",\n" +
            "        \"value\": \"441800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"东莞\",\n" +
            "        \"value\": \"441900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"中山\",\n" +
            "        \"value\": \"442000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"潮州\",\n" +
            "        \"value\": \"445100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"揭阳\",\n" +
            "        \"value\": \"445200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"云浮\",\n" +
            "        \"value\": \"445300\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"广东省\",\n" +
            "    \"value\": \"440000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南宁\",\n" +
            "        \"value\": \"450100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"柳州\",\n" +
            "        \"value\": \"450200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"桂林\",\n" +
            "        \"value\": \"450300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"梧州\",\n" +
            "        \"value\": \"450400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"北海\",\n" +
            "        \"value\": \"450500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"防城港\",\n" +
            "        \"value\": \"450600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"钦州\",\n" +
            "        \"value\": \"450700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"贵港\",\n" +
            "        \"value\": \"450800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"玉林\",\n" +
            "        \"value\": \"450900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"百色\",\n" +
            "        \"value\": \"451000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"贺州\",\n" +
            "        \"value\": \"451100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"河池\",\n" +
            "        \"value\": \"451200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"来宾\",\n" +
            "        \"value\": \"451300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"崇左\",\n" +
            "        \"value\": \"451400\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"广西壮族自治区\",\n" +
            "    \"value\": \"450000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"海口\",\n" +
            "        \"value\": \"460100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"三亚\",\n" +
            "        \"value\": \"460200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"五指山\",\n" +
            "        \"value\": \"469001\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"琼海\",\n" +
            "        \"value\": \"469002\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"儋州\",\n" +
            "        \"value\": \"469003\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"文昌\",\n" +
            "        \"value\": \"469005\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"万宁\",\n" +
            "        \"value\": \"469006\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"东方\",\n" +
            "        \"value\": \"469007\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"定安\",\n" +
            "        \"value\": \"469025\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"屯昌\",\n" +
            "        \"value\": \"469026\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"澄迈\",\n" +
            "        \"value\": \"469027\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"临高\",\n" +
            "        \"value\": \"469028\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"白沙\",\n" +
            "        \"value\": \"469030\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"昌江\",\n" +
            "        \"value\": \"469031\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"乐东\",\n" +
            "        \"value\": \"469033\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"陵水\",\n" +
            "        \"value\": \"469034\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"保亭\",\n" +
            "        \"value\": \"469035\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"琼中\",\n" +
            "        \"value\": \"469036\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"西沙群岛\",\n" +
            "        \"value\": \"469037\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南沙群岛\",\n" +
            "        \"value\": \"469038\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"中沙群岛的岛礁及其海域\",\n" +
            "        \"value\": \"469039\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"海南省\",\n" +
            "    \"value\": \"460000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [],\n" +
            "    \"label\": \"重庆市\",\n" +
            "    \"value\": \"500000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"成都\",\n" +
            "        \"value\": \"510100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"自贡\",\n" +
            "        \"value\": \"510300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"攀枝花\",\n" +
            "        \"value\": \"510400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"泸州\",\n" +
            "        \"value\": \"510500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"德阳\",\n" +
            "        \"value\": \"510600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"绵阳\",\n" +
            "        \"value\": \"510700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"广元\",\n" +
            "        \"value\": \"510800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"遂宁\",\n" +
            "        \"value\": \"510900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"内江\",\n" +
            "        \"value\": \"511000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"乐山\",\n" +
            "        \"value\": \"511100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"南充\",\n" +
            "        \"value\": \"511300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"眉山\",\n" +
            "        \"value\": \"511400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宜宾\",\n" +
            "        \"value\": \"511500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"广安\",\n" +
            "        \"value\": \"511600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"达州\",\n" +
            "        \"value\": \"511700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"雅安\",\n" +
            "        \"value\": \"511800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"巴中\",\n" +
            "        \"value\": \"511900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"资阳\",\n" +
            "        \"value\": \"512000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阿坝\",\n" +
            "        \"value\": \"513200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"甘孜\",\n" +
            "        \"value\": \"513300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"凉山\",\n" +
            "        \"value\": \"513400\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"四川省\",\n" +
            "    \"value\": \"510000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"贵阳\",\n" +
            "        \"value\": \"520100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"六盘水\",\n" +
            "        \"value\": \"520200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"遵义\",\n" +
            "        \"value\": \"520300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"安顺\",\n" +
            "        \"value\": \"520400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"铜仁\",\n" +
            "        \"value\": \"522200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黔西南\",\n" +
            "        \"value\": \"522300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"毕节\",\n" +
            "        \"value\": \"522400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黔东南\",\n" +
            "        \"value\": \"522600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黔南\",\n" +
            "        \"value\": \"522700\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"贵州省\",\n" +
            "    \"value\": \"520000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"昆明\",\n" +
            "        \"value\": \"530100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"曲靖\",\n" +
            "        \"value\": \"530300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"玉溪\",\n" +
            "        \"value\": \"530400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"保山\",\n" +
            "        \"value\": \"530500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"昭通\",\n" +
            "        \"value\": \"530600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"丽江\",\n" +
            "        \"value\": \"530700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"思茅\",\n" +
            "        \"value\": \"530800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"临沧\",\n" +
            "        \"value\": \"530900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"楚雄\",\n" +
            "        \"value\": \"532300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"红河\",\n" +
            "        \"value\": \"532500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"文山\",\n" +
            "        \"value\": \"532600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"西双版纳\",\n" +
            "        \"value\": \"532800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"大理\",\n" +
            "        \"value\": \"532900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"德宏\",\n" +
            "        \"value\": \"533100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"怒江\",\n" +
            "        \"value\": \"533300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"迪庆\",\n" +
            "        \"value\": \"533400\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"云南省\",\n" +
            "    \"value\": \"530000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"拉萨\",\n" +
            "        \"value\": \"540100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"昌都\",\n" +
            "        \"value\": \"542100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"山南\",\n" +
            "        \"value\": \"542200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"日喀则\",\n" +
            "        \"value\": \"542300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"那曲\",\n" +
            "        \"value\": \"542400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阿里\",\n" +
            "        \"value\": \"542500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"林芝\",\n" +
            "        \"value\": \"542600\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"西藏自治区\",\n" +
            "    \"value\": \"540000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"西安\",\n" +
            "        \"value\": \"610100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"铜川\",\n" +
            "        \"value\": \"610200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"宝鸡\",\n" +
            "        \"value\": \"610300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"咸阳\",\n" +
            "        \"value\": \"610400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"渭南\",\n" +
            "        \"value\": \"610500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"延安\",\n" +
            "        \"value\": \"610600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"汉中\",\n" +
            "        \"value\": \"610700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"榆林\",\n" +
            "        \"value\": \"610800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"安康\",\n" +
            "        \"value\": \"610900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"商洛\",\n" +
            "        \"value\": \"611000\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"陕西省\",\n" +
            "    \"value\": \"610000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"兰州\",\n" +
            "        \"value\": \"620100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"嘉峪关\",\n" +
            "        \"value\": \"620200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"金昌\",\n" +
            "        \"value\": \"620300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"白银\",\n" +
            "        \"value\": \"620400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"天水\",\n" +
            "        \"value\": \"620500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"武威\",\n" +
            "        \"value\": \"620600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"张掖\",\n" +
            "        \"value\": \"620700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"平凉\",\n" +
            "        \"value\": \"620800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"酒泉\",\n" +
            "        \"value\": \"620900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"庆阳\",\n" +
            "        \"value\": \"621000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"定西\",\n" +
            "        \"value\": \"621100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"陇南\",\n" +
            "        \"value\": \"622600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"临夏\",\n" +
            "        \"value\": \"622900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"甘南\",\n" +
            "        \"value\": \"6230000\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"甘肃省\",\n" +
            "    \"value\": \"620000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"西宁\",\n" +
            "        \"value\": \"630100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"海东\",\n" +
            "        \"value\": \"632100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"海北\",\n" +
            "        \"value\": \"632200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"黄南\",\n" +
            "        \"value\": \"632300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"海南\",\n" +
            "        \"value\": \"632500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"果洛\",\n" +
            "        \"value\": \"632600\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"玉树\",\n" +
            "        \"value\": \"632700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"海西\",\n" +
            "        \"value\": \"632800\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"青海省\",\n" +
            "    \"value\": \"630000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"银川\",\n" +
            "        \"value\": \"640100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"石嘴山\",\n" +
            "        \"value\": \"640200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"吴忠\",\n" +
            "        \"value\": \"640300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"固原\",\n" +
            "        \"value\": \"640400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"中卫\",\n" +
            "        \"value\": \"640500\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"宁夏回族自治区\",\n" +
            "    \"value\": \"640000\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"children\": [\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"乌鲁木齐\",\n" +
            "        \"value\": \"650100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"克拉玛依\",\n" +
            "        \"value\": \"650200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"吐鲁番\",\n" +
            "        \"value\": \"650300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"哈密\",\n" +
            "        \"value\": \"650400\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"昌吉\",\n" +
            "        \"value\": \"650500\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"博尔塔拉\",\n" +
            "        \"value\": \"652700\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"巴音郭楞\",\n" +
            "        \"value\": \"652800\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阿克苏\",\n" +
            "        \"value\": \"652900\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"克孜勒苏柯尔克孜\",\n" +
            "        \"value\": \"653000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"喀什\",\n" +
            "        \"value\": \"653100\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"和田\",\n" +
            "        \"value\": \"653200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"伊犁哈萨克\",\n" +
            "        \"value\": \"654000\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"奎屯\",\n" +
            "        \"value\": \"654003\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"塔城\",\n" +
            "        \"value\": \"654200\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"阿勒泰\",\n" +
            "        \"value\": \"654300\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"children\": [],\n" +
            "        \"label\": \"石河子\",\n" +
            "        \"value\": \"659001\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"label\": \"新疆维吾尔自治区\",\n" +
            "    \"value\": \"650000\"\n" +
            "  }\n" +
            "]";

        final ObjectMapper objectMapper = new ObjectMapper();
        final JsonMapper jsonMapper = new JsonMapper(objectMapper);
        final List<Area> areas = jsonMapper.fromJson(str, jsonMapper.contructCollectionType(List.class, Area.class));
        for (Area area : areas) {
            printArea(null, area);
        }
    }

    private static void printArea(Area parent, Area area) {
        final long power = atomicLong.getAndAdd(1);
        if (null == parent) {
            System.out.println("  select ins.s_prod_config_prop.nextval into parent_option_id from dual;");
            System.out.println(
                "  insert into ins.prod_config_option (OPTION_ID, PARENT_OPTION_ID, PROP_ID, NAME, CODE, POWER, CUSTOM_FLAG, CREATE_TIME, MODIFY_TIME, UUID, XYZ_CODE)\n"
                    + "  values (parent_option_id, 0, global_prop_id, '" + area.getLabel() + "', '" + area.getValue()
                    + "', " + power + ", 0, sysdate, sysdate, parent_option_id, '" + area.getValue() + "');");
        } else {
            System.out.println(
                "  insert into ins.prod_config_option (OPTION_ID, PARENT_OPTION_ID, PROP_ID, NAME, CODE, POWER, CUSTOM_FLAG, CREATE_TIME, MODIFY_TIME, UUID, XYZ_CODE)\n"
                    + "  values (ins.s_prod_config_prop.nextval, parent_option_id, global_prop_id, '" + area.getLabel()
                    + "', '"
                    + area.getValue()
                    + "', " + power + ", 0, sysdate, sysdate, ins.s_prod_config_prop.currval, '" + area.getValue()
                    + "');");
        }
        System.out.println("");
        List<Area> children;
        if (CollectionUtils.isNotEmpty(children = area.getChildren())) {
            for (Area child : children) {
                printArea(area, child);
            }
        }
    }

    public static class Area implements Serializable {
        private static final long serialVersionUID = 6180283803250824305L;

        private String label;
        private String value;
        private List<Area> children;

        public String getLabel() {
            return label;
        }

        public void setLabel(String label) {
            this.label = label;
        }

        public String getValue() {
            return value;
        }

        public void setValue(String value) {
            this.value = value;
        }

        public List<Area> getChildren() {
            return children;
        }

        public void setChildren(List<Area> children) {
            this.children = children;
        }
    }
}
